# #이차원 리스트
# apart = [['101호','102호'],
#          ['201호','202호'],
#          ['301호','303호']]


# stock = [['시가', 100,200,300],
#          ['종가', 80,210,330]]

# stock = {
#     "시가":[100,200,300]
#     "종가":[80,210,330]
# }


stock = {
    '10/10':[80,110,70,90],
    '10/11':[210,230,190,200]
}
print(stock['10/10'])

# 이중루프
apart = [ [101,102],
         [201,202],
         [301,302]]
for 층 in apart:
    for 집 in 층:
        print(집)

# 역순 출력
apart = [ [101,102],
         [201,202],
         [301,302]]
for 층 in apart[::-1]:
    for 집 in 층:
        print(집, '호')


apart = [ [101,102],
         [201,202],
         [301,302]]
for 층 in apart[::-1]:
    for 집 in 층[::-1]:
        print(집, '호')

apart = [ [101,102],
         [201,202],
         [301,302]]
for 층 in apart:
    for 집 in 층:
        print(집, '호')
        print('-'*8)

apart = [ [101,102],
         [201,202],
         [301,302]]
for 층 in apart:
    for 집 in 층:
        print(집, '호')
    print('-'*8)

apart = [ [101,102],
         [201,202],
         [301,302]]
for 층 in apart:
    for 집 in 층:
        print(집, '호')
print('-'*8)